Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/dma.h
/* -------- DMA_BDSSA : (DMA Offset: 0x10) (R/W 32) CURRENT BUFFER DESCRIPTOR SOURCE START ADDRESS -------- */
#define DMA_BDSSA_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_BDSSA) CURRENT BUFFER DESCRIPTOR SOURCE START ADDRESS  Reset Value */

#define DMA_BDSSA_SSA_Pos                     _UINT32_(0)                                          /* (DMA_BDSSA) Source Start Address Position */
#define DMA_BDSSA_SSA_Msk                     (_UINT32_(0xFFFFFFFF) << DMA_BDSSA_SSA_Pos)          /* (DMA_BDSSA) Source Start Address Mask */
#define DMA_BDSSA_SSA(value)                  (DMA_BDSSA_SSA_Msk & (_UINT32_(value) << DMA_BDSSA_SSA_Pos)) /* Assigment of value for SSA in the DMA_BDSSA register */
#define DMA_BDSSA_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (DMA_BDSSA) Register Mask  */


/* -------- DMA_BDDSA : (DMA Offset: 0x14) (R/W 32) CURRENT BUFFER DESCRIPTOR DESTINATION START ADDRESS -------- */
#define DMA_BDDSA_RESETVALUE                  _UINT32_(0x00)                                       /*  (DMA_BDDSA) CURRENT BUFFER DESCRIPTOR DESTINATION START ADDRESS  Reset Value */

#define DMA_BDDSA_DSA_Pos                     _UINT32_(0)                                          /* (DMA_BDDSA) Destination Start Address Position */
#define DMA_BDDSA_DSA_Msk                     (_UINT32_(0xFFFFFFFF) << DMA_BDDSA_DSA_Pos)          /* (DMA_BDDSA) Destination Start Address Mask */
#define DMA_BDDSA_DSA(value)                  (DMA_BDDSA_DSA_Msk & (_UINT32_(value) << DMA_BDDSA_DSA_Pos)) /* Assigment of value for DSA in the DMA_BDDSA register */
#define DMA_BDDSA_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (DMA_BDDSA) Register Mask  */


/* -------- DMA_BDSSTRD : (DMA Offset: 0x18) (R/W 16) CURRENT BUFFER DESCRIPTOR SOURCE CELL STRIDE -------- */
#define DMA_BDSSTRD_RESETVALUE                _UINT16_(0x00)                                       /*  (DMA_BDSSTRD) CURRENT BUFFER DESCRIPTOR SOURCE CELL STRIDE  Reset Value */

#define DMA_BDSSTRD_SSTRD_Pos                 _UINT16_(0)                                          /* (DMA_BDSSTRD) Source Stride Size Position */
#define DMA_BDSSTRD_SSTRD_Msk                 (_UINT16_(0xFFFF) << DMA_BDSSTRD_SSTRD_Pos)          /* (DMA_BDSSTRD) Source Stride Size Mask */
#define DMA_BDSSTRD_SSTRD(value)              (DMA_BDSSTRD_SSTRD_Msk & (_UINT16_(value) << DMA_BDSSTRD_SSTRD_Pos)) /* Assigment of value for SSTRD in the DMA_BDSSTRD register */
#define DMA_BDSSTRD_Msk                       _UINT16_(0xFFFF)                                     /* (DMA_BDSSTRD) Register Mask  */


/* -------- DMA_BDDSTRD : (DMA Offset: 0x1A) (R/W 16) CURRENT BUFFER DESCRIPTOR DESTINATION CELL STRIDE -------- */
#define DMA_BDDSTRD_RESETVALUE                _UINT16_(0x00)                                       /*  (DMA_BDDSTRD) CURRENT BUFFER DESCRIPTOR DESTINATION CELL STRIDE  Reset Value */

#define DMA_BDDSTRD_DSTRD_Pos                 _UINT16_(0)                                          /* (DMA_BDDSTRD) Destination Stride Size Position */
#define DMA_BDDSTRD_DSTRD_Msk                 (_UINT16_(0xFFFF) << DMA_BDDSTRD_DSTRD_Pos)          /* (DMA_BDDSTRD) Destination Stride Size Mask */
#define DMA_BDDSTRD_DSTRD(value)              (DMA_BDDSTRD_DSTRD_Msk & (_UINT16_(value) << DMA_BDDSTRD_DSTRD_Pos)) /* Assigment of value for DSTRD in the DMA_BDDSTRD register */
#define DMA_BDDSTRD_Msk                       _UINT16_(0xFFFF)                                     /* (DMA_BDDSTRD) Register Mask  */


/* -------- DMA_BDXSIZ : (DMA Offset: 0x1C) (R/W 32) CURRENT BUFFER DESCRIPTOR TRANSFER SIZE -------- */
#define DMA_BDXSIZ_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMA_BDXSIZ) CURRENT BUFFER DESCRIPTOR TRANSFER SIZE  Reset Value */

#define DMA_BDXSIZ_CSZ_Pos                    _UINT32_(0)                                          /* (DMA_BDXSIZ) Cell transfer size in bytes. Position */
#define DMA_BDXSIZ_CSZ_Msk                    (_UINT32_(0x3FF) << DMA_BDXSIZ_CSZ_Pos)              /* (DMA_BDXSIZ) Cell transfer size in bytes. Mask */
#define DMA_BDXSIZ_CSZ(value)                 (DMA_BDXSIZ_CSZ_Msk & (_UINT32_(value) << DMA_BDXSIZ_CSZ_Pos)) /* Assigment of value for CSZ in the DMA_BDXSIZ register */
#define DMA_BDXSIZ_BLKSZ_Pos                  _UINT32_(16)                                         /* (DMA_BDXSIZ) Block transfer size in bytes. Position */
#define DMA_BDXSIZ_BLKSZ_Msk                  (_UINT32_(0xFFFF) << DMA_BDXSIZ_BLKSZ_Pos)           /* (DMA_BDXSIZ) Block transfer size in bytes. Mask */
#define DMA_BDXSIZ_BLKSZ(value)               (DMA_BDXSIZ_BLKSZ_Msk & (_UINT32_(value) << DMA_BDXSIZ_BLKSZ_Pos)) /* Assigment of value for BLKSZ in the DMA_BDXSIZ register */
#define DMA_BDXSIZ_Msk                        _UINT32_(0xFFFF03FF)                                 /* (DMA_BDXSIZ) Register Mask  */


/* -------- DMA_BDPDAT : (DMA Offset: 0x20) (R/W 32) CURRENT BUFFER DESCRIPTOR PATTERN MATCH DATA -------- */
#define DMA_BDPDAT_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMA_BDPDAT) CURRENT BUFFER DESCRIPTOR PATTERN MATCH DATA  Reset Value */

#define DMA_BDPDAT_PDAT_Pos                   _UINT32_(0)                                          /* (DMA_BDPDAT) Channel Pattern Match Data Position */
#define DMA_BDPDAT_PDAT_Msk                   (_UINT32_(0xFFFF) << DMA_BDPDAT_PDAT_Pos)            /* (DMA_BDPDAT) Channel Pattern Match Data Mask */
#define DMA_BDPDAT_PDAT(value)                (DMA_BDPDAT_PDAT_Msk & (_UINT32_(value) << DMA_BDPDAT_PDAT_Pos)) /* Assigment of value for PDAT in the DMA_BDPDAT register */
#define DMA_BDPDAT_PIGN_Pos                   _UINT32_(24)                                         /* (DMA_BDPDAT) Channel Pattern Ignore Value Position */
#define DMA_BDPDAT_PIGN_Msk                   (_UINT32_(0xFF) << DMA_BDPDAT_PIGN_Pos)              /* (DMA_BDPDAT) Channel Pattern Ignore Value Mask */
#define DMA_BDPDAT_PIGN(value)                (DMA_BDPDAT_PIGN_Msk & (_UINT32_(value) << DMA_BDPDAT_PIGN_Pos)) /* Assigment of value for PIGN in the DMA_BDPDAT register */
#define DMA_BDPDAT_Msk                        _UINT32_(0xFF00FFFF)                                 /* (DMA_BDPDAT) Register Mask  */


/* -------- DMA_BDCRCDAT : (DMA Offset: 0x24) (R/W 32) CURRENT BUFFER DESCRIPTOR CRC/CHECKSUM DATA -------- */
#define DMA_BDCRCDAT_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_BDCRCDAT) CURRENT BUFFER DESCRIPTOR CRC/CHECKSUM DATA  Reset Value */

#define DMA_BDCRCDAT_CRCDAT_Pos               _UINT32_(0)                                          /* (DMA_BDCRCDAT) CRC/Checksum Data Register Position */
#define DMA_BDCRCDAT_CRCDAT_Msk               (_UINT32_(0xFFFFFFFF) << DMA_BDCRCDAT_CRCDAT_Pos)    /* (DMA_BDCRCDAT) CRC/Checksum Data Register Mask */
#define DMA_BDCRCDAT_CRCDAT(value)            (DMA_BDCRCDAT_CRCDAT_Msk & (_UINT32_(value) << DMA_BDCRCDAT_CRCDAT_Pos)) /* Assigment of value for CRCDAT in the DMA_BDCRCDAT register */
#define DMA_BDCRCDAT_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (DMA_BDCRCDAT) Register Mask  */


/* -------- DMA_CHCTRLA : (DMA Offset: 0x00) (R/W 32) CHANNEL CONTROL REGISTER A -------- */
#define DMA_CHCTRLA_RESETVALUE                _UINT32_(0x00)                                       /*  (DMA_CHCTRLA) CHANNEL CONTROL REGISTER A  Reset Value */

#define DMA_CHCTRLA_ENABLE_Pos                _UINT32_(0)                                          /* (DMA_CHCTRLA) Channel Enable Position */
#define DMA_CHCTRLA_ENABLE_Msk                (_UINT32_(0x1) << DMA_CHCTRLA_ENABLE_Pos)            /* (DMA_CHCTRLA) Channel Enable Mask */
#define DMA_CHCTRLA_ENABLE(value)             (DMA_CHCTRLA_ENABLE_Msk & (_UINT32_(value) << DMA_CHCTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the DMA_CHCTRLA register */
#define DMA_CHCTRLA_LLEN_Pos                  _UINT32_(8)                                          /* (DMA_CHCTRLA) Linked List Enable Position */
#define DMA_CHCTRLA_LLEN_Msk                  (_UINT32_(0x1) << DMA_CHCTRLA_LLEN_Pos)              /* (DMA_CHCTRLA) Linked List Enable Mask */
#define DMA_CHCTRLA_LLEN(value)               (DMA_CHCTRLA_LLEN_Msk & (_UINT32_(value) << DMA_CHCTRLA_LLEN_Pos)) /* Assigment of value for LLEN in the DMA_CHCTRLA register */
#define DMA_CHCTRLA_SWFRC_Pos                 _UINT32_(16)                                         /* (DMA_CHCTRLA) Software Forced Trigger Position */
#define DMA_CHCTRLA_SWFRC_Msk                 (_UINT32_(0x1) << DMA_CHCTRLA_SWFRC_Pos)             /* (DMA_CHCTRLA) Software Forced Trigger Mask */
#define DMA_CHCTRLA_SWFRC(value)              (DMA_CHCTRLA_SWFRC_Msk & (_UINT32_(value) << DMA_CHCTRLA_SWFRC_Pos)) /* Assigment of value for SWFRC in the DMA_CHCTRLA register */
#define DMA_CHCTRLA_RUNSTDBY_Pos              _UINT32_(24)                                         /* (DMA_CHCTRLA) Run In Standby Position */
#define DMA_CHCTRLA_RUNSTDBY_Msk              (_UINT32_(0x1) << DMA_CHCTRLA_RUNSTDBY_Pos)          /* (DMA_CHCTRLA) Run In Standby Mask */
#define DMA_CHCTRLA_RUNSTDBY(value)           (DMA_CHCTRLA_RUNSTDBY_Msk & (_UINT32_(value) << DMA_CHCTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the DMA_CHCTRLA register */
#define DMA_CHCTRLA_Msk                       _UINT32_(0x01010101)                                 /* (DMA_CHCTRLA) Register Mask  */


/* -------- DMA_CHCTRLB : (DMA Offset: 0x04) (R/W 32) CHANNEL CONTROL REGISTER B -------- */
#define DMA_CHCTRLB_RESETVALUE                _UINT32_(0x00)                                       /*  (DMA_CHCTRLB) CHANNEL CONTROL REGISTER B  Reset Value */

#define DMA_CHCTRLB_WAS_Pos                   _UINT32_(0)                                          /* (DMA_CHCTRLB) Channel Write Address Sequence. Position */
#define DMA_CHCTRLB_WAS_Msk                   (_UINT32_(0x7) << DMA_CHCTRLB_WAS_Pos)               /* (DMA_CHCTRLB) Channel Write Address Sequence. Mask */
#define DMA_CHCTRLB_WAS(value)                (DMA_CHCTRLB_WAS_Msk & (_UINT32_(value) << DMA_CHCTRLB_WAS_Pos)) /* Assigment of value for WAS in the DMA_CHCTRLB register */
#define   DMA_CHCTRLB_WAS_BYTE_ADDR_INCR_Val  _UINT32_(0x0)                                        /* (DMA_CHCTRLB) Incrementing Address+1 with Transfers of Byte Operands  */
#define   DMA_CHCTRLB_WAS_HALF_WORD_ADDR_INCR_Val _UINT32_(0x1)                                        /* (DMA_CHCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands  */
#define   DMA_CHCTRLB_WAS_AUTO_ADDR_INCR_Val  _UINT32_(0x2)                                        /* (DMA_CHCTRLB) Auto Increment Address and Transfer Size  */
#define   DMA_CHCTRLB_WAS_FIXED_BYTE_ADDR_INCR_Val _UINT32_(0x3)                                        /* (DMA_CHCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)  */
#define   DMA_CHCTRLB_WAS_FIXED_HALF_WORD_ADDR_INCR_Val _UINT32_(0x4)                                        /* (DMA_CHCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)  */
#define   DMA_CHCTRLB_WAS_FIXED_WORD_ADDR_INCR_Val _UINT32_(0x5)                                        /* (DMA_CHCTRLB) Fixed Address Word Burst Transfer  */
#define DMA_CHCTRLB_WAS_BYTE_ADDR_INCR        (DMA_CHCTRLB_WAS_BYTE_ADDR_INCR_Val << DMA_CHCTRLB_WAS_Pos) /* (DMA_CHCTRLB) Incrementing Address+1 with Transfers of Byte Operands Position  */
#define DMA_CHCTRLB_WAS_HALF_WORD_ADDR_INCR   (DMA_CHCTRLB_WAS_HALF_WORD_ADDR_INCR_Val << DMA_CHCTRLB_WAS_Pos) /* (DMA_CHCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands Position  */
#define DMA_CHCTRLB_WAS_AUTO_ADDR_INCR        (DMA_CHCTRLB_WAS_AUTO_ADDR_INCR_Val << DMA_CHCTRLB_WAS_Pos) /* (DMA_CHCTRLB) Auto Increment Address and Transfer Size Position  */
#define DMA_CHCTRLB_WAS_FIXED_BYTE_ADDR_INCR  (DMA_CHCTRLB_WAS_FIXED_BYTE_ADDR_INCR_Val << DMA_CHCTRLB_WAS_Pos) /* (DMA_CHCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs) Position  */
#define DMA_CHCTRLB_WAS_FIXED_HALF_WORD_ADDR_INCR (DMA_CHCTRLB_WAS_FIXED_HALF_WORD_ADDR_INCR_Val << DMA_CHCTRLB_WAS_Pos) /* (DMA_CHCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address) Position  */
#define DMA_CHCTRLB_WAS_FIXED_WORD_ADDR_INCR  (DMA_CHCTRLB_WAS_FIXED_WORD_ADDR_INCR_Val << DMA_CHCTRLB_WAS_Pos) /* (DMA_CHCTRLB) Fixed Address Word Burst Transfer Position  */
#define DMA_CHCTRLB_RAS_Pos                   _UINT32_(4)                                          /* (DMA_CHCTRLB) Channel Read Address Sequence Position */
#define DMA_CHCTRLB_RAS_Msk                   (_UINT32_(0x7) << DMA_CHCTRLB_RAS_Pos)               /* (DMA_CHCTRLB) Channel Read Address Sequence Mask */
#define DMA_CHCTRLB_RAS(value)                (DMA_CHCTRLB_RAS_Msk & (_UINT32_(value) << DMA_CHCTRLB_RAS_Pos)) /* Assigment of value for RAS in the DMA_CHCTRLB register */
#define   DMA_CHCTRLB_RAS_BYTE_ADDR_INCR_Val  _UINT32_(0x0)                                        /* (DMA_CHCTRLB) Incrementing Address+1 with Transfers of Byte Operands  */
#define   DMA_CHCTRLB_RAS_HALF_WORD_ADDR_INCR_Val _UINT32_(0x1)                                        /* (DMA_CHCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands  */
#define   DMA_CHCTRLB_RAS_AUTO_ADDR_INCR_Val  _UINT32_(0x2)                                        /* (DMA_CHCTRLB) Auto Increment Address and Transfer Size  */
#define   DMA_CHCTRLB_RAS_FIXED_BYTE_ADDR_INCR_Val _UINT32_(0x3)                                        /* (DMA_CHCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)  */
#define   DMA_CHCTRLB_RAS_FIXED_HALF_WORD_ADDR_INCR_Val _UINT32_(0x4)                                        /* (DMA_CHCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)  */
#define   DMA_CHCTRLB_RAS_FIXED_WORD_ADDR_INCR_Val _UINT32_(0x5)                                        /* (DMA_CHCTRLB) Fixed Address Word Burst Transfer  */
#define DMA_CHCTRLB_RAS_BYTE_ADDR_INCR        (DMA_CHCTRLB_RAS_BYTE_ADDR_INCR_Val << DMA_CHCTRLB_RAS_Pos) /* (DMA_CHCTRLB) Incrementing Address+1 with Transfers of Byte Operands Position  */
#define DMA_CHCTRLB_RAS_HALF_WORD_ADDR_INCR   (DMA_CHCTRLB_RAS_HALF_WORD_ADDR_INCR_Val << DMA_CHCTRLB_RAS_Pos) /* (DMA_CHCTRLB) Incrementing Address+2 with Transfers of HalfWord Operands Position  */
#define DMA_CHCTRLB_RAS_AUTO_ADDR_INCR        (DMA_CHCTRLB_RAS_AUTO_ADDR_INCR_Val << DMA_CHCTRLB_RAS_Pos) /* (DMA_CHCTRLB) Auto Increment Address and Transfer Size Position  */
#define DMA_CHCTRLB_RAS_FIXED_BYTE_ADDR_INCR  (DMA_CHCTRLB_RAS_FIXED_BYTE_ADDR_INCR_Val << DMA_CHCTRLB_RAS_Pos) /* (DMA_CHCTRLB) Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs) Position  */
#define DMA_CHCTRLB_RAS_FIXED_HALF_WORD_ADDR_INCR (DMA_CHCTRLB_RAS_FIXED_HALF_WORD_ADDR_INCR_Val << DMA_CHCTRLB_RAS_Pos) /* (DMA_CHCTRLB) Fixed Address of HalfWord Operand (Single HalfWord Aligned Address) Position  */
#define DMA_CHCTRLB_RAS_FIXED_WORD_ADDR_INCR  (DMA_CHCTRLB_RAS_FIXED_WORD_ADDR_INCR_Val << DMA_CHCTRLB_RAS_Pos) /* (DMA_CHCTRLB) Fixed Address Word Burst Transfer Position  */
#define DMA_CHCTRLB_PRI_Pos                   _UINT32_(8)                                          /* (DMA_CHCTRLB) Channel Priority level. Position */
#define DMA_CHCTRLB_PRI_Msk                   (_UINT32_(0x3) << DMA_CHCTRLB_PRI_Pos)               /* (DMA_CHCTRLB) Channel Priority level. Mask */
#define DMA_CHCTRLB_PRI(value)                (DMA_CHCTRLB_PRI_Msk & (_UINT32_(value) << DMA_CHCTRLB_PRI_Pos)) /* Assigment of value for PRI in the DMA_CHCTRLB register */
#define   DMA_CHCTRLB_PRI_PRI_1_Val           _UINT32_(0x0)                                        /* (DMA_CHCTRLB) Channel Priority is 1  */
#define   DMA_CHCTRLB_PRI_PRI_2_Val           _UINT32_(0x1)                                        /* (DMA_CHCTRLB) Channel Priority is 2  */
#define   DMA_CHCTRLB_PRI_PRI_3_Val           _UINT32_(0x2)                                        /* (DMA_CHCTRLB) Channel Priority is 3 (HIGHEST)  */
#define DMA_CHCTRLB_PRI_PRI_1                 (DMA_CHCTRLB_PRI_PRI_1_Val << DMA_CHCTRLB_PRI_Pos)   /* (DMA_CHCTRLB) Channel Priority is 1 Position  */
#define DMA_CHCTRLB_PRI_PRI_2                 (DMA_CHCTRLB_PRI_PRI_2_Val << DMA_CHCTRLB_PRI_Pos)   /* (DMA_CHCTRLB) Channel Priority is 2 Position  */
#define DMA_CHCTRLB_PRI_PRI_3                 (DMA_CHCTRLB_PRI_PRI_3_Val << DMA_CHCTRLB_PRI_Pos)   /* (DMA_CHCTRLB) Channel Priority is 3 (HIGHEST) Position  */
#define DMA_CHCTRLB_WBOEN_Pos                 _UINT32_(13)                                         /* (DMA_CHCTRLB) Write Byte Order Enable Position */
#define DMA_CHCTRLB_WBOEN_Msk                 (_UINT32_(0x1) << DMA_CHCTRLB_WBOEN_Pos)             /* (DMA_CHCTRLB) Write Byte Order Enable Mask */
#define DMA_CHCTRLB_WBOEN(value)              (DMA_CHCTRLB_WBOEN_Msk & (_UINT32_(value) << DMA_CHCTRLB_WBOEN_Pos)) /* Assigment of value for WBOEN in the DMA_CHCTRLB register */
#define DMA_CHCTRLB_BYTORD_Pos                _UINT32_(14)                                         /* (DMA_CHCTRLB) Byte Order Position */
#define DMA_CHCTRLB_BYTORD_Msk                (_UINT32_(0x3) << DMA_CHCTRLB_BYTORD_Pos)            /* (DMA_CHCTRLB) Byte Order Mask */
#define DMA_CHCTRLB_BYTORD(value)             (DMA_CHCTRLB_BYTORD_Msk & (_UINT32_(value) << DMA_CHCTRLB_BYTORD_Pos)) /* Assigment of value for BYTORD in the DMA_CHCTRLB register */
#define   DMA_CHCTRLB_BYTORD_BYTORD_NONE_Val  _UINT32_(0x0)                                        /* (DMA_CHCTRLB) Bytes are processed AS IS  */
#define   DMA_CHCTRLB_BYTORD_BYTORD_WORD_SWIZZLE_Val _UINT32_(0x1)                                        /* (DMA_CHCTRLB) Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3  */
#define   DMA_CHCTRLB_BYTORD_BYTORD_HALF_WORD_SWIZZLE_Val _UINT32_(0x2)                                        /* (DMA_CHCTRLB) Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2  */
#define   DMA_CHCTRLB_BYTORD_BYTORD_BYTE_SWIZZLE_Val _UINT32_(0x3)                                        /* (DMA_CHCTRLB) Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1  */
#define DMA_CHCTRLB_BYTORD_BYTORD_NONE        (DMA_CHCTRLB_BYTORD_BYTORD_NONE_Val << DMA_CHCTRLB_BYTORD_Pos) /* (DMA_CHCTRLB) Bytes are processed AS IS Position  */
#define DMA_CHCTRLB_BYTORD_BYTORD_WORD_SWIZZLE (DMA_CHCTRLB_BYTORD_BYTORD_WORD_SWIZZLE_Val << DMA_CHCTRLB_BYTORD_Pos) /* (DMA_CHCTRLB) Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3 Position  */
#define DMA_CHCTRLB_BYTORD_BYTORD_HALF_WORD_SWIZZLE (DMA_CHCTRLB_BYTORD_BYTORD_HALF_WORD_SWIZZLE_Val << DMA_CHCTRLB_BYTORD_Pos) /* (DMA_CHCTRLB) Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2 Position  */
#define DMA_CHCTRLB_BYTORD_BYTORD_BYTE_SWIZZLE (DMA_CHCTRLB_BYTORD_BYTORD_BYTE_SWIZZLE_Val << DMA_CHCTRLB_BYTORD_Pos) /* (DMA_CHCTRLB) Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1 Position  */
#define DMA_CHCTRLB_TRIG_Pos                  _UINT32_(16)                                         /* (DMA_CHCTRLB) Trigger that can Start a Channel Transfer Position */
#define DMA_CHCTRLB_TRIG_Msk                  (_UINT32_(0xFF) << DMA_CHCTRLB_TRIG_Pos)             /* (DMA_CHCTRLB) Trigger that can Start a Channel Transfer Mask */
#define DMA_CHCTRLB_TRIG(value)               (DMA_CHCTRLB_TRIG_Msk & (_UINT32_(value) << DMA_CHCTRLB_TRIG_Pos)) /* Assigment of value for TRIG in the DMA_CHCTRLB register */
#define DMA_CHCTRLB_PIGNEN_Pos                _UINT32_(24)                                         /* (DMA_CHCTRLB) Enable Pattern Ignore Byte Position */
#define DMA_CHCTRLB_PIGNEN_Msk                (_UINT32_(0x1) << DMA_CHCTRLB_PIGNEN_Pos)            /* (DMA_CHCTRLB) Enable Pattern Ignore Byte Mask */
#define DMA_CHCTRLB_PIGNEN(value)             (DMA_CHCTRLB_PIGNEN_Msk & (_UINT32_(value) << DMA_CHCTRLB_PIGNEN_Pos)) /* Assigment of value for PIGNEN in the DMA_CHCTRLB register */
#define DMA_CHCTRLB_PATLEN_Pos                _UINT32_(25)                                         /* (DMA_CHCTRLB) Pattern Match Length Position */
#define DMA_CHCTRLB_PATLEN_Msk                (_UINT32_(0x1) << DMA_CHCTRLB_PATLEN_Pos)            /* (DMA_CHCTRLB) Pattern Match Length Mask */
#define DMA_CHCTRLB_PATLEN(value)             (DMA_CHCTRLB_PATLEN_Msk & (_UINT32_(value) << DMA_CHCTRLB_PATLEN_Pos)) /* Assigment of value for PATLEN in the DMA_CHCTRLB register */
#define DMA_CHCTRLB_PATEN_Pos                 _UINT32_(26)                                         /* (DMA_CHCTRLB) Channel Pattern Match Abort Enable. Position */
#define DMA_CHCTRLB_PATEN_Msk                 (_UINT32_(0x1) << DMA_CHCTRLB_PATEN_Pos)             /* (DMA_CHCTRLB) Channel Pattern Match Abort Enable. Mask */
#define DMA_CHCTRLB_PATEN(value)              (DMA_CHCTRLB_PATEN_Msk & (_UINT32_(value) << DMA_CHCTRLB_PATEN_Pos)) /* Assigment of value for PATEN in the DMA_CHCTRLB register */
#define DMA_CHCTRLB_CASTEN_Pos                _UINT32_(29)                                         /* (DMA_CHCTRLB) Cell Auto Start Enable of Ensuing Transfers for this channel Position */
#define DMA_CHCTRLB_CASTEN_Msk                (_UINT32_(0x1) << DMA_CHCTRLB_CASTEN_Pos)            /* (DMA_CHCTRLB) Cell Auto Start Enable of Ensuing Transfers for this channel Mask */
#define DMA_CHCTRLB_CASTEN(value)             (DMA_CHCTRLB_CASTEN_Msk & (_UINT32_(value) << DMA_CHCTRLB_CASTEN_Pos)) /* Assigment of value for CASTEN in the DMA_CHCTRLB register */
#define DMA_CHCTRLB_CRCEN_Pos                 _UINT32_(31)                                         /* (DMA_CHCTRLB) CRC Enable bit Position */
#define DMA_CHCTRLB_CRCEN_Msk                 (_UINT32_(0x1) << DMA_CHCTRLB_CRCEN_Pos)             /* (DMA_CHCTRLB) CRC Enable bit Mask */
#define DMA_CHCTRLB_CRCEN(value)              (DMA_CHCTRLB_CRCEN_Msk & (_UINT32_(value) << DMA_CHCTRLB_CRCEN_Pos)) /* Assigment of value for CRCEN in the DMA_CHCTRLB register */
#define DMA_CHCTRLB_Msk                       _UINT32_(0xA7FFE377)                                 /* (DMA_CHCTRLB) Register Mask  */


/* -------- DMA_CHEVCTRL : (DMA Offset: 0x08) (R/W 32) CHANNEL EVENT CONTROL REGISTER -------- */
#define DMA_CHEVCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (DMA_CHEVCTRL) CHANNEL EVENT CONTROL REGISTER  Reset Value */

