Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/dma.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DMA_DESCRIPTOR register API structure */
typedef struct
{  /* Direct Memory Access Controller */
  __IO  uint32_t                       DMA_BDNXT;          /**< Offset: 0x00 (R/W  32) NEXT BUFFER DESCRIPTOR ADDRESS POINTER */
  __IO  uint32_t                       DMA_BDCFG;          /**< Offset: 0x04 (R/W  32) CURRENT BUFFER DESCRIPTOR CONFIGURATION */
  __IO  uint32_t                       DMA_BDCTRLB;        /**< Offset: 0x08 (R/W  32) CURRENT BUFFER DESCRIPTOR CONTROL REGISTER B */
  __IO  uint16_t                       DMA_BDEVCTRL;       /**< Offset: 0x0C (R/W  16) CURRENT BUFFER DESCRIPTOR EVENT CONTROL */
  __IO  uint16_t                       DMA_BDCTRLCRC;      /**< Offset: 0x0E (R/W  16) CURRENT BUFFER DESCRIPTOR CRC CONTROL */
  __IO  uint32_t                       DMA_BDSSA;          /**< Offset: 0x10 (R/W  32) CURRENT BUFFER DESCRIPTOR SOURCE START ADDRESS */
  __IO  uint32_t                       DMA_BDDSA;          /**< Offset: 0x14 (R/W  32) CURRENT BUFFER DESCRIPTOR DESTINATION START ADDRESS */
  __IO  uint16_t                       DMA_BDSSTRD;        /**< Offset: 0x18 (R/W  16) CURRENT BUFFER DESCRIPTOR SOURCE CELL STRIDE */
  __IO  uint16_t                       DMA_BDDSTRD;        /**< Offset: 0x1A (R/W  16) CURRENT BUFFER DESCRIPTOR DESTINATION CELL STRIDE */
  __IO  uint32_t                       DMA_BDXSIZ;         /**< Offset: 0x1C (R/W  32) CURRENT BUFFER DESCRIPTOR TRANSFER SIZE */
  __IO  uint32_t                       DMA_BDPDAT;         /**< Offset: 0x20 (R/W  32) CURRENT BUFFER DESCRIPTOR PATTERN MATCH DATA */
  __IO  uint32_t                       DMA_BDCRCDAT;       /**< Offset: 0x24 (R/W  32) CURRENT BUFFER DESCRIPTOR CRC/CHECKSUM DATA */
} dma_descriptor_registers_t
#ifdef __GNUC__
  __attribute__ ((aligned (4)))
#endif
;

/** \brief CHANNEL register API structure */
typedef struct
{
  __IO  uint32_t                       DMA_CHCTRLA;        /**< Offset: 0x00 (R/W  32) CHANNEL CONTROL REGISTER A */
  __IO  uint32_t                       DMA_CHCTRLB;        /**< Offset: 0x04 (R/W  32) CHANNEL CONTROL REGISTER B */
  __IO  uint32_t                       DMA_CHEVCTRL;       /**< Offset: 0x08 (R/W  32) CHANNEL EVENT CONTROL REGISTER */
  __IO  uint32_t                       DMA_CHINTENCLR;     /**< Offset: 0x0C (R/W  32) CHANNEL INTERRUPT ENABLE CLEAR REGISTER */
  __IO  uint32_t                       DMA_CHINTENSET;     /**< Offset: 0x10 (R/W  32) CHANNEL INTERRUPT ENABLE SET REGISTER */
  __IO  uint32_t                       DMA_CHINTF;         /**< Offset: 0x14 (R/W  32) CHANNEL INTERRUPT FLAG REGISTER */
  __IO  uint32_t                       DMA_CHSSA;          /**< Offset: 0x18 (R/W  32) CHANNEL SOURCE START ADDRESS */
  __IO  uint32_t                       DMA_CHDSA;          /**< Offset: 0x1C (R/W  32) CHANNEL DESTINATION START ADDRESS */
  __IO  uint32_t                       DMA_CHSSTRD;        /**< Offset: 0x20 (R/W  32) CHANNEL SOURCE CELL STRIDE SIZE REGISTER */
  __IO  uint32_t                       DMA_CHDSTRD;        /**< Offset: 0x24 (R/W  32) CHANNEL DESTINATION CELL STRIDE SIZE REGISTER */
  __IO  uint32_t                       DMA_CHXSIZ;         /**< Offset: 0x28 (R/W  32) CHANNEL TRANSFER SIZE REGISTER */
  __IO  uint32_t                       DMA_CHPDAT;         /**< Offset: 0x2C (R/W  32) CHANNEL PATTERN MATCH DATA */
  __IO  uint32_t                       DMA_CHCTRLCRC;      /**< Offset: 0x30 (R/W  32) CHANNEL CONTROL CRC */
  __IO  uint32_t                       DMA_CHCRCDAT;       /**< Offset: 0x34 (R/W  32) CHANNEL CRC/CHECKSUM DATA REGISTER */
  __IO  uint32_t                       DMA_CHNXT;          /**< Offset: 0x38 (R/W  32) CHANNEL NEXT DESCRIPTOR ADDRESS POINTER */
  __I   uint32_t                       DMA_CHLLCFGSTAT;    /**< Offset: 0x3C (R/   32) CHANNEL LINKED LIST CONFIGURATION STATUS REGISTER */
  __I   uint32_t                       DMA_CHSTATBC;       /**< Offset: 0x40 (R/   32) CHANNEL STATUS BLOCK COUNT REGISTER */
  __I   uint32_t                       DMA_CHSTATCC;       /**< Offset: 0x44 (R/   32) CHANNEL STATUS CELL COUNT REGISTER */
  __I   uint32_t                       DMA_CHSTAT;         /**< Offset: 0x48 (R/   32) CHANNEL STATUS REGISTER */
  __I   uint8_t                        Reserved1[0x04];
} dma_channel_registers_t;

#define DMA_CHANNEL_NUMBER 8

/** \brief DMA register API structure */
typedef struct
{  /* Direct Memory Access Controller */
  __IO  uint32_t                       DMA_CTRLA;          /**< Offset: 0x00 (R/W  32) DMA CONTROL A REGISTER */
  __IO  uint32_t                       DMA_CTRLB;          /**< Offset: 0x04 (R/W  32) DMA CONTROL B REGISTER */
  __IO  uint32_t                       DMA_DBGCTRL;        /**< Offset: 0x08 (R/W  32) DEBUG CONTROL REGISTER */
  __IO  uint32_t                       DMA_CRCPOLYA;       /**< Offset: 0x0C (R/W  32) DMA CRC POLYNOMIAL A REGISTER */
  __IO  uint32_t                       DMA_CRCPOLYB;       /**< Offset: 0x10 (R/W  32) DMA CRC POLYNOMIAL B REGISTER */
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       DMA_INTSTAT3;       /**< Offset: 0x18 (R/   32) DMA INTERRUPT PRIORITY 3 STATUS REGISTER */
  __I   uint32_t                       DMA_INTSTAT2;       /**< Offset: 0x1C (R/   32) DMA INTERRUPT PRIORITY 2 STATUS REGISTER */
  __I   uint32_t                       DMA_INTSTAT1;       /**< Offset: 0x20 (R/   32) DMA INTERRUPT PRIORITY 1 STATUS REGISTER */
  __I   uint8_t                        Reserved2[0x2C];
        dma_channel_registers_t        CHANNEL[DMA_CHANNEL_NUMBER]; /**< Offset: 0x50  */
} dma_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** \brief DMA_DESCRIPTOR memory section attribute */
#if defined (__GNUC__) || defined (__CC_ARM)
 #define SECTION_DMA_DESCRIPTOR       __attribute__ ((section(".hsram")))
#elif defined (__ICCARM__)
 #define SECTION_DMA_DESCRIPTOR       @".hsram"
#else
 #ifndef SECTION_DMA_DESCRIPTOR
  #error SECTION_DMA_DESCRIPTOR must be defined for compiler to use memory section .hsram
 #endif
#endif

#endif /* _PIC32CKSG01_DMA_COMPONENT_H_ */
